{
    "meta": {
        "name": "The Musical Heist",
        "beginning": "title",
        "author": "The Bloomington Beck Kids",
        "defaults": {
            "merge": true,
            "fileVolume": 0.1
        },
        "version": 1.32
    },
    "game": {
        "title": {
            "speech": "The Musical Heist: A CDAdventure by The Bloomington Beck Kids.",
            "file": "bobdylan_base.mp3",
            "fileVolume": 0.2,
            "options": {
                "start the game": "start"
            }
        },
        "start": {
            "speech": "You are a master thief, and you have been hired to steal Bob Dylan's famous harmonica. You have been given a map of the building, and you know that the harmonica is in the basement. You have also been given a list of the security guards' schedules. You have to get the harmonica and get out before the guards catch you. Good luck!",
            "file": "bobdylan2.mp3",
            "options": {
                "Check the security guards' schedules": "schedules_nothing",
                "Plan your route": "route_nothing"
            }
        },
        "schedules_nothing": {
            "speech": "You look at the schedules, and you notice that the guards change shifts every 30 minutes. You also notice that there are 3 guards on duty at all times. You will have to be quick and quiet to avoid getting caught. The next shift change is in 10 minutes. You put the schedules back and get ready to move.",
            "file": "bobdylan3.mp3",
            "options": {
                "Plan your route": "route_scheduled"
            }
        },
        "route_nothing": {
            "speech": "You look at the map and see that the basement is on the other side of the building from where you are. You will have to go through the main lobby, the kitchen, and the storage room to get there. You will also have to avoid the guards. You take a deep breath and get ready to move.",
            "file": "bobdylan4.mp3",
            "options": {
                "Check the security guards' schedules": "schedules_routed"
            }
        },
        "route_scheduled": {
            "speech": "You look at the map and see that the basement is on the other side of the building from where you are. You will have to go through the main lobby, the kitchen, and the storage room to get there. You will also have to avoid the guards. You take a deep breath and get ready to move.",
            "file": "bobdylan4.mp3",
            "options": {
                "Grab your tools and move out": "tools"
            }
        },
        "schedules_routed": {
            "speech": "You look at the schedules, and you notice that the guards change shifts every 30 minutes. You also notice that there are 3 guards on duty at all times. You will have to be quick and quiet to avoid getting caught. The next shift change is in 10 minutes. You put the schedules back and get ready to move.",
            "file": "bobdylan3.mp3",
            "options": {
                "Grab your tools and move out": "tools"
            }
        },
        "tools": {
            "speech": "You grab your tools and move out. You reach the main lobby and see the guard at the front desk. You wait for him to turn his back and then you slip past him. Unfortunatly for you, he was turning to look at the security camera feed and saw you out of the corner of his eye. He hits the alarm button and you hear the sirens start to wail. You quickly reach the alarm box, but you need to do this correctly to avoid getting caught. You have 10 seconds to enter the correct code. You notice a small post-it saying that the code apparently started at 5967 six hours ago, but every hour the code changes by the number of guards on duty plus the interval between shift changes. What is the code?",
            "file": "bobdylan5.mp3",
            "options": {
                "the code is 6264": "wrong1",
                "the code is 6165": "correct",
                "the code is 5821": "wrong2",
                "the code is 6053": "wrong3"
            }
        },
        "wrong1": {
            "speech": "You enter the code 6264, but the alarm continues to wail and there is a loud beep and you see a marker that shows 1 out of 2 tries. What is the code?",
            "file": "bobdylan6.mp3",
            "options": {
                "the code is 6165": "correct",
                "the code is 5821": "wrong4",
                "the code is 6053": "wrong5"
            }
        },
        "wrong2": {
            "speech": "You enter the code 5821, but the alarm continues to wail and there is a loud beep and you see a marker that shows 1 out of 2 tries. What is the code?",
            "file": "bobdylan6.mp3",
            "options": {
                "the code is 6264": "wrong4",
                "the code is 6165": "correct",
                "the code is 6053": "wrong5"
            }
        },
        "wrong3": {
            "speech": "You enter the code 6053, but the alarm continues to wail and there is a loud beep and you see a marker that shows 1 out of 2 tries. What is the code?",
            "file": "bobdylan6.mp3",
            "options": {
                "the code is 6264": "wrong4",
                "the code is 5821": "wrong5",
                "the code is 6165": "correct"
            }
        },
        "wrong4": {
            "speech": "You enter the code, but the alarm continues to wail and there is a loud beep and you see a marker that shows 2 out of 2 tries. The system locks and you have been caught. Game over.",
            "file": "bobdylan6.mp3",
            "end": true
        },
        "wrong5": {
            "speech": "You enter the code, but the alarm continues to wail and there is a loud beep and you see a marker that shows 2 out of 2 tries. The system locks and you have been caught. Game over.",
            "file": "bobdylan6.mp3",
            "end": true
        },
        "correct": {
            "speech": "You enter the code 6165, and the alarm stops wailing. You hear the sirens outside and know that the police are on their way. You quickly move towards the basement and into the kitchen. You hear the sound of chopping butcher's knives as the chef prepares food for the following morning. You curse quietly as you hear the sounds coming towards you. You have to make a decision quickly.",
            "file": "bobdylan7.mp3",
            "options": {
                "Hide in the pantry": "pantry",
                "Hide in the freezer": "freezer",
                "Try to sneak past the chef": "sneak"
            }
        },
        "pantry": {
            "speech": "You hide in the pantry and hear the chef walk past you. You wait for a few minutes and then you hear the chef walk back, and you slink your way into the dumbwaiter. You quickly press the button to go up on the outside and feel yourself rising.",
            "file": "bobdylan8.mp3",
            "options": {
                "Continue": "bedroom"
            }
        },
        "freezer": {
            "speech": "You hide in the freezer and hear the chef walk past you. You wait for a few minutes and then you hear the chef walk back, but he opens the freezer door and you are caught. Game over.",
            "file": "bobdylan8.mp3",
            "end": true
        },
        "sneak": {
            "speech": "You try to sneak past the chef, but he hears you and turns around. You see the chef's face and he looks at you with a smile. He says, 'I knew you would come for the harmonica. I have been waiting for you.' You are caught. Game over.",
            "file": "bobdylan8.mp3",
            "end": true
        },
        "bedroom": {
            "speech": "You reach the bedroom and see Bob Dylan laying on the bed, sound asleep. You need to tip-toe past him and out the door, but before that you see a bunch of keys on the nightstand. You have to make a decision quickly.",
            "file": "bobdylan9.mp3",
            "options": {
                "Grab the keys": "grab_keys",
                "Leave the keys": "leave_keys"
            }
        },
        "grab_keys": {
            "speech": "You grab the keys and make your way out the door. You reach the basement, but you find a big vault door blocking your way. You try the keys, and one works, but there is another lock that needs a code on the inside. You sneak in and carefully close the door. You soon realize that in the small space in between the locks, there isn't much air. You have to make a decision within the next 120 seconds. (for this track, please do not pause.) You look around you and see near the lock a small piece of paper. It only says 45, 11, 32, 22, but you recognize this as a book cipher and it says on the paper Genesis 1:1 1:5 1:6. Once you have the code, add all of the digits together and then add the digits in the resulting number together and add that to the current track. Go to that track.",
            "file": "bobdylan10.mp3",
            "silenceLength": 30, 
            "noAppend": true
        },
        "vault_90_seconds": {
            "speech": "90 seconds remaining",
            "file": "bobdylan11.mp3",
            "silenceLength": 30,
            "noAppend": true
        },
        "vault_60_seconds": {
            "speech": "60 seconds remaining",
            "file": "bobdylan12.mp3",
            "silenceLength": 30,
            "noAppend": true
        },
        "vault_30_seconds": {
            "speech": "30 seconds remaining",
            "file": "bobdylan13.mp3",
            "silenceLength": 30,
            "noAppend": true
        },
        "failed_vault": {
            "speech": "You've ran out of time! As you lay on the ground, wondering what went wrong, you hear your breathing grow heavy and then slowly grow still as you run out of air. Game over. Go to track  {start}  to try again.",
            "file": "bobdylan1.mp3",
            "end": true
        },
        "succeeded_vault": {
            "speech": "Good job, you entered the correct code! You are now in the vault. What do you want to do?",
            "file": "bobdylan1.mp3",
            "options": {
                "Grab the harmonica and leave": "harmonica",
                "Look around the vault": "look_around"
            }
        },
        "harmonica": {
            "speech": "You quickly go for the harmonica and unknowingly set off a silent alarm. You hear the sound of footsteps coming towards you. You have been caught. Game over.",
            "file": "bobdylan2.mp3",
            "end": true
        },
        "look_around": {
            "speech": "You look around the vault and notice a bunch of small holes inset into the walls. You realize these are places for lasers and that, had you immediately gone for the harmonica, you would have set off the alarm. You also notice a small safe in the corner of the room. To get to either, you need to dodge the lasers.",
            "file": "bobdylan2.mp3",
            "options": {
                "Dodge the lasers and go for the safe": "safe",
                "Dodge the lasers and go for the harmonica": "harmonica",
                "Put out a fine mist from a spray can to make the lasers visible": "mist"
            }
        },
        "safe": {
            "speech": "You attempt to go for the safe, but hit the lasers. You have been caught. Game over.",
            "file": "bobdylan3.mp3",
            "end": true
        },
        "mist": {
            "speech": "You use the mist and wait a bit for it to make the lasers visible.",
            "file": "bobdylan3.mp3",
            "options": {
                "Dodge the lasers and go for the safe": "safe2",
                "Dodge the lasers and go for the harmonica": "harmonica2"
            }
        },
        "safe2": {
            "speech": "You dodge the lasers and make it to the safe. You try the code 45113222, and it opens. Inside you find a small box. You open it and find a note that says, 'Congratulations! You have successfully completed The Musical Heist. Thank you for playing!'. You find this weird, as what is The Musical Heist? You shake it off and grab the harmonica. You make your way out of the vault and out of the building. You have successfully completed the game. Thanks for playing!",
            "file": "bobdylan4.mp3",
            "end": true
        },
        "harmonica2": {
            "speech": "You dodge the lasers and make it to the harmonica. You grab it and make your way out of the vault and out of the building. You have successfully completed the game. Thanks for playing!",
            "file": "bobdylan4.mp3",
            "end": true
        }
    }
}